[
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "No. She... she... told me...."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Hey, hey, this is going the wrong way. I didn't mean any of this to go this way. This is not an argument."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "It's fine man."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Lucas."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I'm telling you, man, I just. I can't work with you. I cannot."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "What do you... I painted a picture of what I needed, and and and it is not."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "What picture? You haven’t told me one thing."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "It..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "So if I were to put it together, and get..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I don’t want you to put it together, I don't want you to put it together. I don't want it. I don’t want it anymore."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "So if it's. I don't care what you want. Things need to... As a business, you and I need certain things, and I know exactly what it is, but..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Pitching it to you while you're yelling at me is not the way."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And I and I. I understand what you're upset about and anything that you want help on."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I want to make better moving forward, not just for the minute. And this is not an argument. But"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "... and this is one even this wasn't even like a planned talk. I just thought we could talk about inner structure. And these are issues that we have."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No finger pointing."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And most of the issues are we don't have our shit together because we're running and doing all these other things."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Instead of doing our normal jobs, and then you can't get your answers to do your job. So I have ways to do this."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "let me put it together so it is a complete thought. and all I got to do is just pull the trigger on it, if after we talk about it. Because I would like to hear your thoughts, what you would like to add because you're on the other side, this is a completely amicable conversation."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No attacking at all. I just think we need a couple things. And over the phone talking like this is never easy. I don't... and I get it. No one's attacking anyone. But for you to get your answers, I want to get them faster. It's not even about answers. It's just when the way jobs move through are hindered, we got to move that blockage."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And yes, it's more work up front to do that, but it is the intelligent thing to do and we will be happier on the other side,"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I’m not asking for anything extra from you. I'm just talking to you about the structure of our place and I. I mean, there's no feelings in the structure of our place. The structure is the structure."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And if we look at it and you say “it's fine”, okay, well then how do we fix these XYZ problems? Okay, well then let's try this. Let's try this. And I might be completely wrong on what I think we need. All we gotta do is talk."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And it's it's not an argument. And if you're busy right now and frustrated from other things, just say so and I'll just patch it together and we can come back to it when things calm down."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "But there may be a couple, you know, this, that and the other thing that we might need in the in the meantime, being one of these two people that were interviewing, maybe that might make things better. And then we kick the can down the road on something else. I mean, these are I'm not asking for and like, I give you due dates or anything."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I mean, I don't I don't know what I could do to be more professional or I'm trying to paint this in the nicest picture."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I still dont... I still don't have any clarity on this, on what I need to do and what I can do."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know I it's so, so Luke, you want me to just tell you all the pieces and why right now?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "No, but..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "It's complex."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "... yesterday you come at me..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No, there is no coming at you. No, no, no..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Saying we need somebody doing support over here, and that makes no sense. That means more work and we can't handle more work."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "But okay."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We can. We have the throughput. We just need to be putting them on days when we're not doing other things."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "How do we make sure that that happens? There's many steps in there, steps that involve you and me and everyone who touches the job. I want to make that better. And no one is coming at you. There is no you in here."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "This is our business and let me make you happy. I'm trying, man."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I not unhappy."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I’m unhappy because I don't... I don't ever see it being anything thats different. I've been in the same place that I’ve been of saying It's not worth it for either of us at any point."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And so. But but then why do we keep doing it if, I mean, if this."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Because its the only fucking thing that is my absolute lifeline."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know, I know. And guess what? I got a way to make it better. All you gotta do is listen."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And it's very complex, but it's very simple. That's all I'm saying, bro."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Why not build a better machine?"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And I don't even need you to do anything. I'll just roll it out to you like I just did this system."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And that, I mean, the system is going to help us light years. dude."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And, I get it. In a frustrated state: “Fuck moving to the other system. It's too much work. We're too busy.”"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Yes."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I know. I am 100,000% on board with it."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "But but but I. Please not, now please don't end now. Please don't interrupt me. So what did I do? I went and figured it out through the night, on top of untying the books and doing all that. Just so we could move forward."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We are where we are."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I'm going to make this., I'm just going to make the system better. And we'll figure it out. And there's no arguing. This is,"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I don't know, a business where the two owners can't talk, but here we are."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I mean, I don't know how I could have painted a different story..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "And I appreciate it."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I mean, tell me what I did wrong."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I don't want to do it wrong."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "It's just the same. It's just the same cycle."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Yeah, it is the same cycle in the cycle is."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "JZ role playing as LG: “Oh, I don't want to have that conversation. We're going to argue.”"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No, we're not going to argue."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "JZ role playing as LG: “Oh come on, don't come at me like...”"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No one's coming at you. And then I sit and then I have to like, massage these things and then it becomes a whole thing when it didn't have to be at all."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "It's, hey, you know how we haven't, like, talked about the business as, you know, as the like, look at it from top down in quite a while?"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We probably should. That's what we're doing. I get it, you're frustrated. If you don't want... If you're busy right now, just tell me."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I mean, we wasted so much time on arguing about actually nothing."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "You and I actually agree. You realize that, right?"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We both realize we need shit to be better., but I don't know where you think this is coming at you."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "The coming at me was yesterday."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No., I..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "In saying “okay, did we get a posting about somebody to support this? I hope we're not building a house of cards.”"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "So is that coming at you?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Yeah, because..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "How?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "That’s the last thing, that's the last thing to me that is necessary, right."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Well..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I told you that in saying I don't... I don't and we do not need that because adding anyone is all it is, is going to generate more work. And I'm not saying quote unquote work on things that I've just nonsense."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "it's creating more orders."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We want more orders. We want more orders."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Not in the current state that we’re in."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know. I know. It's almost like I'm asking for another state for us to be in, which is what I'm trying to do. I got a way to get to that state."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "That's fine. That's all I'm addressing in saying that's..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I do not need that and we do not need that."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Okay. Okay..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "And me saying, we have somebody who is working for fucking free who is already doing tenfold what Jay was able to do. I don't care about the... I’m not even bringing that up."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "You do. I feel like this is why you're mad. I feel like this is why you're mad."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "It has nothing to do with why I’m mad."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Because it's almost like you can't even hear what the real question was."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "It’s not even a question. I'm going to do it. I'm going to make the system better. It'll benefit everybody and we'll be happy. We could come back to the sales thing. If you're caught on that, we'll come back to that."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I will."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I’m caught on the fact that you’re taking... I appreciate you trying to help, but you're taking on too many things that drive us to this point where you get frustrated..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No, no, no, I take it because..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I feel like you should take it. But when you do, you get frustrated."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "What do you want me to do?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "You can't. You can't. Which is why I do it. Just to make it easier, and ..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I think that's bullshit. And I think without any sort of concrete example of that, thats even further bullshit."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Really?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I can't ask anymore times of what you would like, give me fucking 100 things you would like me to do."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Get us... get a sales person, number one, I mean..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "What we should do. Here, what... I know what we should do. Let's call IMEC."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "They know what to do. I'm pretty sure they wouldn't say keep going with one salesperson and let that set one salesperson generate so much that there's so much on the line for that everything becomes hell when we don't, when we're unable to deliver."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And then have so little jobs to run through that the people here leave because they're worried, because no jobs are coming through."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "There's there's a lot that I'm not taking..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Why are we taking another sales person because you're worried about the amount of work and the amount of money that is coming in?"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Again. I said, we'll table the conversation. Let's let's work on internals. We'll get internals where they need to be, and then hopefully in a good situation, we'll need another situation, another, sales person. How about that?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Sure. But I think part of that conversation is that... I don't... the reality, I guess is the fact that I, I do not..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I'm not interested in scaling anymore."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Well, this isn't about but you also you also can't be interested in as to just not replace anyone when they leave because that job still needs to be done. And there has been..."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "It's being done."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "By who?"
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "It's been done for free."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Here we are."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "It’s a completely different person."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Okay, Lucas..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "It’s already being handled. I have all the support that I need."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I got to get back to what I'm doing here. I didn't want to argue and this is not an argument at all. I see your side. You're you're partial owner. You're you're you're, you know, allowed to have your own opinion. But these are important things and we'll, we'll come back to it when we could talk.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "And I didn't you know what? Every time it comes up you cannot even...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Oh, wow.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "You cannot even... It's fine.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Again. There's there's no talking right now. It makes no sense to keep going.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Theres no talking in general because we're back to where we were three months ago.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I don't know why. I don't know why.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "And the reality is I don’t want to do this anymore.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "What did I do?",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "I don’t.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Lucas, what did I do?",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "It has nothing to do with you and it has everything to do with you and it's our relationship. It's. It's just everything in general, I don't.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Which...?",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "It is where it is and it is... It will continue to be our life and that's fine.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I don't...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "But I'm just still in the same...",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "You’re fighting yourself. You're fighting yourself on this.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "I’m not fighting myself at all.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I gave us every out to get out of this conversation in a nice way. It's going the right way.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "It doesn’t matter not, it's not that the...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "It's never gone away. It's never gone away. (unheard).",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I know, and what are we arguing about? What are we arguing about? I don't even know what we are arguing about. If you could just say what we're arguing...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "It’s just a statement. I'm not happy with this. I'm not happy with the company. I'm not happy with our relationship. I'm interested in pursuing it further. I'm not interested in scaling it further.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "This is not scaling. This is maintaining...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Okay.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Getting us to under that ceiling where we already were so we could both be able to do exactly what we've talked about. No one is changing anything. I’m just trying to make it easier for everyone.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "I don't want it easier. I just don't want it.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "So. Okay. I mean, what am I supposed to do?",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "The same thing that you have been doing.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I mean, in... in... in that... which is everything. Which is fine, and I understand, but it can't be that forever. You're...",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "And again, this is nothing we need to figure out, bro. I just think that we need to get our answers to you sooner. That's all I was saying.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I'll figure it out. I don't want to say I'll figure it out, because then it just sounds like I'm taking it off the plate. This is a conversation for both of us, and we can talk when it's not so heated. I, I literally, I feel I came at this in a completely emotionless manner. I feel like I painted a picture that I hoped you would understand.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I don't know what I could do better here. I even said, hey, why don't I just write this down? And you said, I don't want to see it.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "I don't want to see it, because I don't want you to do it because I don't want to hear about it later. About this took this long.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "When have I ever said that? When have I ever said that?",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Everything . Everything.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Okay.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Yeah, and it sucks. It's upsetting because that's every single thing. what a lot of the big problems of the relationship and I just...",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Is, is that I tell you how long something took because you can't understand that while I was doing that, I was supposed to be doing something else. Which is why I tell you, it took so long to explain to you why we're behind on XYZ, which I still will deliver on. How can I help you? I mean, I.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I'm ready to, at any minute, hit the reset button and start the conversation over. I don't know how I could do this better. Lucas. I mean, there are I mean, you would agree businesses need to make decisions, right?",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Yes.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Okay. I was just trying to help us make a decision. I said my side sounds like you're against it. Or we could talk about it again later or whatever. Forget about it now. Besides that, I do need to get into Printavo figure out how to move this job through there and figure out the purchase orders and make it work.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I love you, man. I, I hope you see there's no emotion in this at all, and no one's coming at anyone you're fucking doing... you're carrying the entire business on your shoulders. And I see that. And I thank you for that. But, with where we are. I'm going to get us up and, moving better. And we are going to need more work coming through I also.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "So I got us this one through this one job that I just put through that was eight grand, and the other one I have out is like 48 grand for Jay Burns. I can help too. I’m not telling you how long it took to do the order, I just I wish you just thought I was someone else, because...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "I don't think it has anything to do with at. I think there's a percentage of that and that's fine. And I don’t... we don’t need to get further into it.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Alright. And...",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I'm at a loss here, but that's fine. We'll work on our communication. I'm trying here and I know we're both on the same page, and I know we're both going through our different shit."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And I know that I love you, and I understand, and this might not be the best time to talk about it. And I don't want to leave you upset because that was not my intention."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We’re... I'm going to keep barreling forward like I always do. And I know you will too."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "This conversation could have went better, but it also could have went worse. We're doing better. So. I get it, man. I get it. So let me please just, not let me I, I am I'm going to go jump back into massaging everything now that we all go the internet back."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We'll get better, bro. It's not... It doesn't have to always be this. I'm just trying to get us there. And my idea doesn't even have to be the idea that gets it there. But it's the start of the conversation of how we get there. And if you're too buried to have that conversation, I get it."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I'll keep moving on my end trying to unbury you the best I can."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I’m not, and I appreciate it and thats fine."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And and I don't need you, and I don't need you to thank me. There's certain things you're going to need to be able to move forward, to handle what you're doing."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "And one of them is peace of mind."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We'll find a way to get that. That's what I'm trying to do. And we'll find a way to get that, now, I know you got a ton of things to do, man. We. We'll talk later. I'm cool."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Okay. I just just to sum all of that up, I'm... I'm going to pass on that Futureshirts thing, man. I don't even want to deal with that and their nonsense. Because there is a lot."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know and see and this is, this is, this is like literally a prime example of like what I'm talking about. We can't handle it because we can't..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "We're not taking it because we can't handle it. But why can't we handle it?"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Because we're barreling forward on three wheels and it's working. And it has been working. But those three on the three wheels, it it exhausts the machine."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I'm just trying to make a better machine."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I mean, which is fine."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Right."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "And only reason that I would even bring it up in the first place."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Because I could sit here and be just a sales asshole and say “sure, yep” and put it all through it and not even have a conversation about it until Monday, and then realize, why do we have a million things that are due on the same day on Wednesday."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Well, that would be being an asshole. What you would have to do is use the system, make sure everyone who needs to know what they need to do knows about it. And if they can't do it in that time period, they let us know. That's the way it should work. And I'm trying to get us that. And I did that.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "And now I feel like we're going to get ahead. And looking for another salesperson takes a while. So whatever, I'll prove to you that the system works better. And then when we both have better confidence, we'll take a look at it again.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Alright.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Please know that I at no point did I ever mean to come at you in any manner. And it's not you at all. It's me acknowledging how much is on you by yourself.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "I appreciate that.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "I'm not... and one thing we should probably talk about is who handles what when things come through on the emails.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Do you want me to start having a prequalifier person or just somehow something so you don't have to look at every fucking one, and then that person either forwards it to you or to me, and then when we get up to where we need to be, you know, to whoever else it needs to handle it.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "No, because that, I mean, I appreciate it.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "In the cleanest way, literally every single thing that occurred when Jay was even here, or even Jay and Jorge, it's all the same thing.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Right.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "The workload has not increased and it has not decreased. Yes.",
    "start": null,
    "end": null,
    "text": "Joseph Zangrilli"
  },
  {
    "speaker": "Right.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "The thing the prequalifiers... I see them no matter what. And I'm not saying this is not my dig to you saying you don't know that something went on the back end between Jay and I.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "When I was out, I was involved in every single fucking thing he did period.",
    "start": null,
    "end": null,
    "text": "Lucas Guariglia"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Right. And that's the wrong person. That's the wrong person."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "RIght, and that's fine. Yeah. Yes. There needs to be a person in that place. I'm telling... and all by telling you that is I have that support right now. Is that the final formula for it is I don't fucking know."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I hope not."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "That it's just... we’re a week and a half into it."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "I know, and in three weeks it's going to be double as bad."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Double what?"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "The hell that we are both... the hell and panic we're both having."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "It's not... that... the panic is not contributing to that at all. I mean, I'm not I'm not concerned with the workload."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "I'm not concerned with the... I'm not... Literally and I'm not just being an asshole about it and..."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "No, no,"
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "The workload causes concerns about getting it done. How do we... Yes."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "But that was the same we did with even with Jay and everybody else."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Yeah. Okay. The wrong employees. And now we just become rigid."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Again the conversation. But again, we'll get there, dude. We'll get there. let me run here."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Keep fighting the good fight. I know you're doing your best. We all are."
  },
  {
    "speaker": "Lucas Guariglia",
    "start": null,
    "end": null,
    "text": "Okay, thanks, man."
  },
  {
    "speaker": "Joseph Zangrilli",
    "start": null,
    "end": null,
    "text": "Thank you, bro."
  }
]
